# Homebrew Bundle file for laptop migration
# Run with: brew bundle --file=~/git/dotfiles/Brewfile

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# Essential CLI tools
brew "git"
brew "gh"                    # GitHub CLI
brew "wget"
brew "curl"
brew "gnupg"                 # GPG for commit signing
brew "pinentry-mac"          # GPG pinentry for macOS

# Shell and terminal tools
brew "zsh"
brew "tmux"
brew "ripgrep"               # Fast grep (rg)
brew "fzf"                   # Fuzzy finder
brew "tree"
brew "htop"
brew "watch"
brew "jq"                    # JSON processor
brew "yq"                    # YAML processor

# Development tools
brew "go"
brew "node"
brew "python@3.11"
brew "rust"
brew "cmake"
brew "make"

# Container and Kubernetes tools
brew "docker"
brew "docker-compose"
brew "kubectl"
brew "kubectx"
brew "kind"                  # Kubernetes in Docker
brew "helm"
brew "kustomize"
brew "openshift-cli"         # oc command
brew "podman"

# Cloud CLI tools
brew "awscli"
brew "azure-cli"
cask "google-cloud-sdk"

# Network tools
brew "nmap"
brew "socat"
brew "spoof-mac"            # MAC address spoofing

# Development utilities
brew "direnv"               # Directory-based environments
brew "pre-commit"           # Git pre-commit hooks
brew "shellcheck"           # Shell script linter
brew "shfmt"               # Shell script formatter

# macOS specific tools
brew "mas"                  # Mac App Store CLI

# Cask applications
cask "visual-studio-code"
cask "iterm2"
cask "docker"
cask "github"               # GitHub Desktop
cask "microsoft-edge"
cask "microsoft-edge-dev"
cask "google-chrome"
cask "slack"
cask "zoom"
cask "1password"
cask "alfred"
cask "rectangle"            # Window management
cask "displaylink"          # DisplayLink Manager

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-cascadia-code"

# VS Code extensions (to be installed via code CLI)
# code --install-extension ms-vscode-remote.remote-ssh
# code --install-extension golang.go
# code --install-extension ms-python.python
# code --install-extension hashicorp.terraform
# code --install-extension redhat.vscode-yaml
# code --install-extension ms-kubernetes-tools.vscode-kubernetes-tools