# Homebrew Bundle file for laptop migration
# Run with: brew bundle --file=~/git/dotfiles/Brewfile

# Taps
tap "snyk/tap"

# Essential CLI tools
brew "git"
brew "gh"                    # GitHub CLI
brew "glab"                  # GitLab CLI
brew "wget"
brew "curl"
brew "gnupg"                 # GPG for commit signing
brew "gpgme"                 # GPG Made Easy library
brew "pinentry-mac"          # GPG pinentry for macOS
brew "bash"

# Shell and terminal tools
brew "coreutils"             # GNU timeout (gtimeout) and other core utils
brew "ripgrep"               # Fast grep (rg)
brew "gnu-sed"               # GNU sed (gsed)
brew "grep"                  # GNU grep
brew "fzf"                   # Fuzzy finder
brew "tree"
brew "htop"
brew "watch"
brew "jq"                    # JSON processor
brew "yq"                    # YAML processor
brew "lynx"                  # Terminal web browser
brew "parallel"              # GNU parallel
brew "mosh"                  # Mobile shell (SSH replacement)

# Development tools
brew "go"
brew "golangci-lint"         # Go linter
brew "node"
brew "node@18"
brew "pipx"                  # Python CLI tool installer
brew "uv"                    # Fast Python package manager
brew "yarn"
brew "pkgconf"               # Package config

# Container and Kubernetes tools
brew "docker"
brew "kubernetes-cli"        # kubectl
brew "minikube"
brew "skopeo"                # Container image utility
brew "lima"                  # Linux VMs on macOS

# Cloud CLI tools
brew "azure-cli"
brew "openshift-cli"         # oc command
brew "rosa-cli"              # ROSA CLI
brew "stern"                 # Multi-pod log tailing

# Network tools
brew "iperf"
brew "iperf3"
brew "spoof-mac"             # MAC address spoofing

# Document and media tools
brew "ffmpeg"
brew "imagemagick"
brew "poppler"               # PDF rendering library
brew "ocrmypdf"              # OCR for PDFs

# YAML/config tools
brew "yamlfix"               # YAML formatter
brew "yamllint"              # YAML linter
brew "cfssl"                 # CloudFlare SSL toolkit

# AI tools
brew "gptme"                 # GPT terminal assistant

# Misc tools
brew "copyparty"             # File sharing server
brew "switchaudio-osx"       # Audio device switcher

# Security
brew "snyk/tap/snyk"         # Snyk vulnerability scanner

# Cask applications
cask "gstreamer-runtime"

# VS Code extensions
vscode "aaron-bond.better-comments"
vscode "aaron00101010.diff-panel"
vscode "acarreiro.calculate"
vscode "adamhartford.vscode-base64"
vscode "antfu.slidev"
vscode "anthropic.claude-code"
vscode "asciidoctor.asciidoctor-vscode"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "brunnerh.insert-unicode"
vscode "chrmarti.regex"
vscode "coderabbit.coderabbit-vscode"
vscode "continue.continue"
vscode "cschlosser.doxdocgen"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitpod.gitpod-desktop"
vscode "gitpod.gitpod-remote-ssh"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "grapecity.gc-excelviewer"
vscode "hackmd.vscode-hackmd"
vscode "hashicorp.terraform"
vscode "haskell.haskell"
vscode "hilleer.yaml-plus-json"
vscode "ibm.wca-core"
vscode "idleberg.applescript"
vscode "idleberg.jxa"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jheilingbrunner.vscode-gnupg-tool"
vscode "joselitofilho.ginkgotestexplorer"
vscode "jsynowiec.vscode-insertdatestring"
vscode "justusadam.language-haskell"
vscode "keesschollaart.vscode-home-assistant"
vscode "lextudio.restructuredtext-pack"
vscode "maelvalais.autoconf"
vscode "maziac.hex-hover-converter"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "medo64.render-crlf"
vscode "mhutchie.git-graph"
vscode "mindaro-dev.file-downloader"
vscode "mitchdenny.ecdc"
vscode "monish.regexsnippets"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "nortakales.date-hover-preview"
vscode "octref.vetur"
vscode "oijaz.unicode-latex"
vscode "oysun.vuehelper"
vscode "paragdiwan.gitpatch"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "pulkitgangwar.nextjs-snippets"
vscode "redhat.ansible"
vscode "redhat.fabric8-analytics"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-openshift-connector"
vscode "redhat.vscode-openshift-extension-pack"
vscode "redhat.vscode-redhat-account"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rjmacarthy.twinny"
vscode "ryu1kn.partial-diff"
vscode "samverschueren.final-newline"
vscode "saoudrizwan.claude-dev"
vscode "scala-lang.scala"
vscode "searking.preview-vscode"
vscode "sohamkamani.code-eol"
vscode "sourcegraph.cody-ai"
vscode "tomoki1207.pdf"
vscode "tumido.cron-explained"
vscode "tyriar.sort-lines"
vscode "waderyan.gitblame"
vscode "yaruson.ascii-unicode-escape"
vscode "yutengjing.vscode-archive"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
